ianjuch/ee149/CC3000 SDK_V1.11/CC3000 SDK/MSP430G2553/Basic WiFi Application/Basic WiFi Source/Source/BasicWiFi Application/basic_wifi_application.c
		pcSockAddrAscii = (pcData + ulDataLength);
		
		// the family is always AF_INET
		tSocketAddr.sa_family = atoshort(pcSockAddrAscii[0], pcSockAddrAscii[1]);
		
		// the destination port
		tSocketAddr.sa_data[0] = ascii_to_char(pcSockAddrAscii[2], pcSockAddrAscii[3]);
		tSocketAddr.sa_data[1] = ascii_to_char(pcSockAddrAscii[4], pcSockAddrAscii[5]);
		
		// the destination IP address
		tSocketAddr.sa_data[2] = ascii_to_char(pcSockAddrAscii[6], pcSockAddrAscii[7]);
		tSocketAddr.sa_data[3] = ascii_to_char(pcSockAddrAscii[8], pcSockAddrAscii[9]);
		tSocketAddr.sa_data[4] = ascii_to_char(pcSockAddrAscii[10], pcSockAddrAscii[11]);
		tSocketAddr.sa_data[5] = ascii_to_char(pcSockAddrAscii[12], pcSockAddrAscii[13]);
		
		sendto(ulSocket, pcData, ulDataLength, 0, &tSocketAddr, sizeof(sockaddr));
		break;
		
		
		// Handle bind command
	case UART_COMMAND_BSD_BIND:
		tSocketAddr.sa_family = AF_INET;
		
		// the source port
		tSocketAddr.sa_data[0] = ascii_to_char(usBuffer[2], usBuffer[3]);
		tSocketAddr.sa_data[1] = ascii_to_char(usBuffer[4], usBuffer[5]);
		
		// all 0 IP address
		memset (&tSocketAddr.sa_data[2], 0, 4);
		
		bind(ulSocket, &tSocketAddr, sizeof(sockaddr));
		
		break;
		
		
		// Handle IP configuration command
	case UART_COMMAND_IP_CONFIG:
		
		// Network mask is assumed to be 255.255.255.0
		pucSubnetMask[0] = 0xFF;
		pucSubnetMask[1] = 0xFF;
		pucSubnetMask[2] = 0xFF;
		pucSubnetMask[3] = 0x0;
		
		pucIP_Addr[0] = ascii_to_char(usBuffer[2], usBuffer[3]);
		pucIP_Addr[1] = ascii_to_char(usBuffer[4], usBuffer[5]);
		pucIP_Addr[2] = ascii_to_char(usBuffer[6], usBuffer[7]);
		pucIP_Addr[3] = ascii_to_char(usBuffer[8], usBuffer[9]);
		
		pucIP_DefaultGWAddr[0] = ascii_to_char(usBuffer[10], usBuffer[11]);
		pucIP_DefaultGWAddr[1] = ascii_to_char(usBuffer[12], usBuffer[13]);
		pucIP_DefaultGWAddr[2] = ascii_to_char(usBuffer[14], usBuffer[15]);
		pucIP_DefaultGWAddr[3] = ascii_to_char(usBuffer[16], usBuffer[17]);
		
		pucDNS[0] = 0;
		pucDNS[1] = 0;
		pucDNS[2] = 0;
		pucDNS[3] = 0;
		
		netapp_dhcp((unsigned long *)pucIP_Addr, (unsigned long *)pucSubnetMask, (unsigned long *)pucIP_DefaultGWAddr, (unsigned long *)pucDNS);
		
		break;
		
		
		// Handle WLAN disconnect command
	case UART_COMMAND_CC3000_DISCONNECT:
		wlan_disconnect();
		break;
		
		// Handle erase policy command
	case UART_COMMAND_CC3000_DEL_POLICY:
		wlan_ioctl_set_connection_policy(DISABLE, DISABLE, DISABLE);
		break;
		
		
		// Handle send DNS Discovery command
	case UART_COMMAND_SEND_DNS_ADVERTIZE:
		if(ulCC3000DHCP)
		{
			mdnsAdvertiser(1,device_name,strlen(device_name));
		}
		
		break;
		
	default:
		P2DIR |= BIT0;
		P2OUT |= BIT0;
		DispatcherUartSendPacket((unsigned char*)pucUARTIllegalCommandString, sizeof(pucUARTIllegalCommandString));
		break;
		
	}
	
	// Send a response - the command handling has finished
	DispatcherUartSendPacket((unsigned char *)(pucUARTCommandDoneString), sizeof(pucUARTCommandDoneString));
}

void fadeOn(unsigned char ledAddr)
{
    unsigned char i = 0;
    while (i < 255)
    {
        i += 5;
        i2cWriteByte(ledAddr, i, 0x60);
        delay_ms(2);
    }
}
void fadeOff(unsigned char ledAddr)
{
    unsigned char i = 255;
    while (i > 0)
    {
        i -= 5;
        i2cWriteByte(ledAddr, i, 0x60);
        delay_ms(2);
    }
}

void i2cWriteByte(unsigned char data0, unsigned char data1, unsigned char address)
{
    while(UCB0STAT & UCBBUSY){

    }
    UCB0I2CSA = address;
    UCB0CTL1 |= UCTR;
    UCB0CTL1 |= UCTXSTT;
    while (!(IFG2 & UCB0TXIFG))
    {
        //__asm__("nop");
    }
    UCB0TXBUF = data0;
    while (!(IFG2 & UCB0TXIFG))
    {
        //__asm__("nop");
    }
    UCB0TXBUF = data1;
    while (!(IFG2 & UCB0TXIFG))
    {
        //__asm__("nop");
    }
    UCB0CTL1 |= UCTXSTP;

    // set UCTXSTP or write another character to the buffer
}
void delay_ms(int d)
{
    int i;
    for (i = 0; i < d; i++)
        __delay_cycles(1000);
}

//*****************************************************************************
//
//! main
//!
//!  @param  None
//!
//!  @return none
//!
//!  @brief  The main loop is executed here
//
//*****************************************************************************

main(void)
{
  WDTCTL = WDTPW + WDTHOLD;
  
  P1DIR |= BIT6 | BIT7;
  P1OUT &= ~BIT6;
  P1OUT &= ~BIT7;

  DCOCTL = 0;
  BCSCTL1 = CALBC1_1MHZ;
  DCOCTL = CALDCO_1MHZ;
  P3SEL |= BIT1 | BIT2; 
	// Set up I2C
	UCB0BR0 = 10; // Divide clock source by 160
	UCB0CTL0 = UCSYNC|UCMST|UCMODE1|UCMODE0;
	UCB0CTL1 = UCSSEL1|UCSSEL0; // Clears reset
	delay_ms(5);
	i2cWriteByte(0x00, 0x00, 0x60);
  delay_ms(5);
  i2cWriteByte(0x00, 0x00, 0x60);
  delay_ms(5);
  i2cWriteByte(0x14, 0xaa, 0x60);
  delay_ms(5);
  i2cWriteByte(0x15, 0xaa, 0x60);
  delay_ms(5);
  i2cWriteByte(0x16, 0xaa, 0x60);
  delay_ms(5);
  i2cWriteByte(0x17, 0xaa, 0x60);

  fadeOn(LED_T_L);

	ulCC3000DHCP = 0;
	ulCC3000Connected = 0;
	ulSocket = 0;
	ulSmartConfigFinished=0;
	
	
	

	//  Board Initialization start
	initDriver();

	// Initialize the UART RX Buffer   
	memset(g_ucUARTBuffer, 0xFF, UART_IF_BUFFER);
	uart_have_cmd =0;

	//char* string = "\nwifi test\n";
	//DispatcherUartSendPacket((unsigned char *)(string), 11);
	
	//connect to access point
	//wlan_connect("TRENDnet637", 11);
	wlan_connect("friendsofthefellowship", 22);
	DispatcherUartSendPacket("connected\n", 10);

	//display the IP address
	while(1){
		if( (ulCC3000DHCP == 1) && (ulCC3000Connected == 1)  && (printOnce == 1) )
		{
			printOnce = 0;
			DispatcherUartSendPacket((unsigned char*)pucCC3000_Rx_Buffer, strlen((char const*)pucCC3000_Rx_Buffer));
			break;
		}
	}

	//create a listening socket
	int server_socket;
	server_socket = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);

	//set port number and bind to it
	int port = 65500;
	sockaddr tSocketAddr;
	tSocketAddr.sa_family = AF_INET;
	tSocketAddr.sa_data[0] = (port & 0xFF00)>> 8;
	tSocketAddr.sa_data[1] = (port & 0x00FF);
	memset (&tSocketAddr.sa_data[2], 0, 4);
	bind(server_socket, &tSocketAddr, sizeof(sockaddr));

	//listen for connections
	listen(server_socket, 1);

	//initialize client info
	int client = 0;
	sockaddr clientaddr;
	socklen_t addrlen;

	//accept connection
	addrlen = sizeof(clientaddr);
	while(client <= 0){
		client = accept(server_socket, (sockaddr*) &clientaddr, &addrlen);
	}
	//display and send an ack
	char msg[9] = "TCP open\n";
	send(client, msg, sizeof(msg), 0);
	DispatcherUartSendPacket((unsigned char *)msg, 9);

	//receive bytes from socket
	char recvBuffer[20];
	int bytesRecvd = recv(client, recvBuffer, sizeof(recvBuffer), 0);
  //fadeOn(LED_T_R);

	//display received data
	DispatcherUartSendPacket((unsigned char *)recvBuffer, bytesRecvd);

	send(client, msg, sizeof(msg), 0);
	DispatcherUartSendPacket((unsigned char *)msg, 9);

	bytesRecvd = recv(client, recvBuffer, sizeof(recvBuffer), 0);
	DispatcherUartSendPacket((unsigned char *)recvBuffer, bytesRecvd);

}

